final String jsonData = '''
 {
  "ایمان": [
    "چقدر به وجود و یکتایی خداوند باور عمیق داری؟",
    "چقدر به روز قیامت و پاداش یا مجازات اعمال باور داری؟"
  ],
  "انفاق و مسئولیت اجتماعی": [
    "چقدر از مال خود به خویشاوندان نیازمند کمک می‌کنی؟",
    "به یتیمان یا مؤسسات خیریه‌ی مربوط به آن‌ها، چقدر کمک می‌کنی؟"
  ],
  "عبادت": [
    "آیا نماز را در زمان مشخص و با حضور قلب می‌خوانی؟",
    "چه میزان در طول روز یا هفته زمانی برای راز و نیاز با خدا اختصاص می‌دهی؟"
  ],
  "وفای به عهد": [
    "وقتی قول می‌دهی، چقدر متعهد به اجرای آن هستی؟",
    "اگر مشکلی پیش بیاید، آیا باز هم برای وفای به عهد تلاش می‌کنی؟"
  ],
  "صبر و پایداری": [
    "هنگام فقر یا بحران مالی، چقدر امیدوار باقی می‌مانی و ناامید نمی‌شوی؟",
    "هنگام مواجهه با بیماری یا ناراحتی جسمی/روانی، چقدر آرامش داری؟"
  ]
}
  ''';

const List<String> recommDescription = [
  """قرآن را با تأمل بخوانید.
سوره بقره، آیه 2: «این کتابی است که در آن شکی نیست، هدی برای پرهیزگاران.»

خدا را زیاد یاد کنید.
سوره رعد، آیه 28: «در یاد خدا دل‌ها آرامش می‌یابد.»

دانش دینی خود را افزایش دهید.
سوره زمر، آیه 9: «آیا کسانی که می‌دانند با کسانی که نمی‌دانند برابرند؟»

به خدا توکل کنید.
سوره طلاق، آیه 3: «و هر که به خدا توکل کند، خدا برای او کافی است.»""",

  """از اموالتان به نیازمندان انفاق کنید
سوره بقره، آیه 177: «و از اموالتان، با اینکه به آن علاقه دارید، به خویشاوندان و یتیمان و نیازمندان و مسافران و کسانی که می‌پرسند و برای آزاد کردن بردگان بدهید.»

زکات و صدقه بدهید
سوره بقره، آیه 43: «و نماز را برپا دارید و زکات بدهید.»

عدالت را در جامعه گسترش دهید
سوره نحل، آیه 90: «خداوند عدالت و نیکوکاری و بخشش به خویشاوندان را فرمان می‌دهد.»""",

  """فقط خدا را عبادت کنید
سوره فاتحه، آیه 5: «تو را می‌پرستیم و از تو کمک می‌خواهیم.»

نماز را به‌جا آورید
سوره بقره، آیه 43: «و نماز را برپا دارید و زکات بدهید و با تسلیم‌شوندگان خم شوید.»

اعمال شایسته را بدون شرک انجام دهید
سوره کهف، آیه 110: «پس هر که امیدوار به دیدار پروردگارش است، کار شایسته کند و در عبادت پروردگارش شریکی قرار ندهد.»""",
  """به همه قراردادها و وعده‌ها پایبند باشید.
سوره مائده، آیه 1: «ای کسانی که ایمان آورده‌اید، به همه قراردادها وفا کنید.»

از شکستن عهد و وعده پرهیز کنید
سوره اسراء، آیه 34: «و به عهد وفا کنید؛ زیرا از عهد سؤال خواهد شد.»

از گفتن چیزی که عمل نمی‌کنید خودداری کنید
سوره صف، آیه 2-3: «چرا می‌گویید آنچه را انجام نمی‌دهید؟ نزد خدا نفرت‌انگیز است که بگویید آنچه را انجام نمی‌دهید.»""",
  """از صبر و نماز کمک بخواهید
سوره بقره، آیه 153: «ای کسانی که ایمان آورده‌اید، از صبر و نماز کمک بگیرید؛ زیرا خدا با صابران است.»

در سختی‌ها و آزمایش‌ها صبور باشید
سوره بقره، آیه 155: «ما قطعاً شما را با ترس و گرسنگی و کاهش اموال و جان‌ها و محصولات آزمایش می‌کنیم، اما به صابران بشارت بده.»

با صبر به اعمال نیک ادامه دهید
سوره هود، آیه 115: «و صبور باشید، زیرا خدا پاداش نیکوکاران را ضایع نمی‌کند.»""",
];
const String sabr_desc = """
از صبر و نماز کمک بخواهید
سوره بقره، آیه 153: «ای کسانی که ایمان آورده‌اید، از صبر و نماز کمک بگیرید؛ زیرا خدا با صابران است.»

در سختی‌ها و آزمایش‌ها صبور باشید
سوره بقره، آیه 155: «ما قطعاً شما را با ترس و گرسنگی و کاهش اموال و جان‌ها و محصولات آزمایش می‌کنیم، اما به صابران بشارت بده.»

با صبر به اعمال نیک ادامه دهید
سوره هود، آیه 115: «و صبور باشید، زیرا خدا پاداش نیکوکاران را ضایع نمی‌کند.»
""";

const String vafa_desc = """به همه قراردادها و وعده‌ها پایبند باشید.
سوره مائده، آیه 1: «ای کسانی که ایمان آورده‌اید، به همه قراردادها وفا کنید.»

از شکستن عهد و وعده پرهیز کنید
سوره اسراء، آیه 34: «و به عهد وفا کنید؛ زیرا از عهد سؤال خواهد شد.»

از گفتن چیزی که عمل نمی‌کنید خودداری کنید
سوره صف، آیه 2-3: «چرا می‌گویید آنچه را انجام نمی‌دهید؟ نزد خدا نفرت‌انگیز است که بگویید آنچه را انجام نمی‌دهید.»""";

// final String jsonData = '''
//  {
//   "ایمان": [
//     "چقدر به وجود و یکتایی خداوند باور عمیق داری؟",
//     "چقدر به روز قیامت و پاداش یا مجازات اعمال باور داری؟",
//     "آیا در زندگی روزمره حضور فرشتگان را حس می‌کنی یا به آن توجه داری؟",
//     "چقدر با قرآن و دیگر کتاب‌های آسمانی ارتباط روزانه یا هفتگی داری؟",
//     "آیا پیامبران را در رفتار و تصمیم‌گیری‌های خود الگو قرار می‌دهی؟"
//   ],
//   "انفاق و مسئولیت اجتماعی": [
//     "چقدر از مال خود به خویشاوندان نیازمند کمک می‌کنی؟",
//     "به یتیمان یا مؤسسات خیریه‌ی مربوط به آن‌ها، چقدر کمک می‌کنی؟",
//     " اگر کسی مسافر یا غریبه و بی‌پناه باشد، چقدر به او کمک می‌کنی؟",
//     "وقتی کسی از تو درخواست کمک یا راهنمایی می‌کند، چقدر پاسخگو هستی؟",
//     "چقدر برای آزادی افراد گرفتار قدمی برداشته‌ای؟"
//   ],
//   "عبادت": [
//     "آیا نماز را در زمان مشخص و با حضور قلب می‌خوانی؟",
//     "چه میزان در طول روز یا هفته زمانی برای راز و نیاز با خدا اختصاص می‌دهی؟",
//     "چقدر زکات، خمس یا صدقه مستحب می‌پردازی؟",
//     "چه میزان قبل از خوابیدن یا بعد از بیدار شدن از خواب، به یاد خدا هستی؟",
//     "چه میزان عبادت برایت لذتی روحی است؟ (و نه وظیفه‌ا‌ی خشک)"
//   ],
//   "وفای به عهد": [
//     "وقتی قول می‌دهی، چقدر متعهد به اجرای آن هستی؟",
//     "اگر مشکلی پیش بیاید، آیا باز هم برای وفای به عهد تلاش می‌کنی؟",
//     "چقدر در تعهدات شغلی، خانوادگی یا دوستانه‌ات مسئولانه عمل می‌کنی؟",
//     "چه میزان به عهدهای قلبی (مثل دوستی یا عشق) پایبند هستی؟",
//     "اگر کسی به تو اعتماد کند، چه میزان اعتمادش را حفظ می‌کنی؟"
//   ],
//   "صبر و پایداری": [
//     "هنگام فقر یا بحران مالی، چقدر امیدوار باقی می‌مانی و ناامید نمی‌شوی؟",
//     "هنگام مواجهه با بیماری یا ناراحتی جسمی/روانی، چقدر آرامش داری؟",
//     "در برابر سختی‌های زندگی، چقدر در مسیر درست باقی می‌مانی؟",
//     "هنگام ناراحتی از دیگران، چقدر خشم خود را کنترل می‌کنی؟",
//     "وقتی دیگران به تو بی‌مهری می‌کنند، چقدر صبوری و گذشت نشان می‌دهی؟"
//   ]
// }
//   ''';
