final String jsonData = '''
 {
  "ایمان": [
    "چقدر به وجود و یکتایی خداوند باور عمیق داری؟",
    "چقدر به روز قیامت و پاداش یا مجازات اعمال باور داری؟",
    "آیا در زندگی روزمره حضور فرشتگان را حس می‌کنی یا به آن توجه داری؟",
    "چقدر با قرآن و دیگر کتاب‌های آسمانی ارتباط روزانه یا هفتگی داری؟",
    "آیا پیامبران را در رفتار و تصمیم‌گیری‌های خود الگو قرار می‌دهی؟"
  ],
  "انفاق و مسئولیت اجتماعی": [
    "چقدر از مال خود به خویشاوندان نیازمند کمک می‌کنی؟",
    "به یتیمان یا مؤسسات خیریه‌ی مربوط به آن‌ها، چقدر کمک می‌کنی؟",
    " اگر کسی مسافر یا غریبه و بی‌پناه باشد، چقدر به او کمک می‌کنی؟",
    "وقتی کسی از تو درخواست کمک یا راهنمایی می‌کند، چقدر پاسخگو هستی؟",
    "چقدر برای آزادی افراد گرفتار قدمی برداشته‌ای؟"
  ],
  "عبادت": [
    "آیا نماز را در زمان مشخص و با حضور قلب می‌خوانی؟",
    "چه میزان در طول روز یا هفته زمانی برای راز و نیاز با خدا اختصاص می‌دهی؟",
    "چقدر زکات، خمس یا صدقه مستحب می‌پردازی؟",
    "چه میزان قبل از خوابیدن یا بعد از بیدار شدن از خواب، به یاد خدا هستی؟",
    "چه میزان عبادت برایت لذتی روحی است؟ (و نه وظیفه‌ا‌ی خشک)"
  ],
  "وفای به عهد": [
    "وقتی قول می‌دهی، چقدر متعهد به اجرای آن هستی؟",
    "اگر مشکلی پیش بیاید، آیا باز هم برای وفای به عهد تلاش می‌کنی؟",
    "چقدر در تعهدات شغلی، خانوادگی یا دوستانه‌ات مسئولانه عمل می‌کنی؟",
    "چه میزان به عهدهای قلبی (مثل دوستی یا عشق) پایبند هستی؟",
    "اگر کسی به تو اعتماد کند، چه میزان اعتمادش را حفظ می‌کنی؟"
  ],
  "صبر و پایداری": [
    "هنگام فقر یا بحران مالی، چقدر امیدوار باقی می‌مانی و ناامید نمی‌شوی؟",
    "هنگام مواجهه با بیماری یا ناراحتی جسمی/روانی، چقدر آرامش داری؟",
    "در برابر سختی‌های زندگی، چقدر در مسیر درست باقی می‌مانی؟",
    "هنگام ناراحتی از دیگران، چقدر خشم خود را کنترل می‌کنی؟",
    "وقتی دیگران به تو بی‌مهری می‌کنند، چقدر صبوری و گذشت نشان می‌دهی؟"
  ]
}
  ''';
